<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>Tag: 독서 - DevLog</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">












<link rel="icon" href="/images/favicon-16x16.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-119771582-1"></script>
<script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments);}
    gtag('js', new Date());

    gtag('config', 'UA-119771582-1');
</script>


    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    DevLog
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">Archives</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="Search" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/coplayer" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section section-heading">
    <div class="container">
        <div class="content">
            <h5>#독서</h5>
        </div>
    </div>
</section>
<section class="section">
    <div class="container">
    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2020/02/09/lifestyle/%EB%8F%85%EC%84%9C%EB%AA%A9%EB%A1%9D2020/" itemprop="url">2020년 독서목록</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-02-09T05:38:00.000Z" itemprop="datePublished">Feb 9 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Lifestyle/">Lifestyle</a>
        </span>
        
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><ol>
<li>&#xB098;&#xB294; &#xD68C;&#xC0AC;&#xCCB4;&#xC9C8;&#xC774; &#xC544;&#xB2C8;&#xB77C;&#xC11C;&#xC694; : &#xC11C;&#xBA54;&#xB9AC; - &#xBC88;&#xC5ED;&#xAC00;&#xB85C; &#xD65C;&#xB3D9; &#xC911;&#xC778; &#xC11C;&#xBA54;&#xB9AC;&#xC758; &#xD504;&#xB79C;&#xC11C; &#xB3C4;&#xC804;&#xAE30;</li>
<li>&#xBD80;&#xC758; &#xBCF8;&#xB2A5; : &#xBE0C;&#xB77C;&#xC6B4; &#xC2A4;&#xD1A4; - &#xC7AC;&#xD14C;&#xD06C; &#xAD00;&#xB828; &#xC11C;&#xC801; &#xB9CE;&#xC740; &#xACF3;&#xC5D0;&#xC11C; &#xCD94;&#xCC9C;&#xD574;&#xC92C;&#xB358; &#xCC45;</li>
<li>&#xC790;&#xBC14;&#xC758; &#xC815;&#xC11D; : &#xB0A8;&#xAD81;&#xC131; - &#xC790;&#xBC14; &#xC5B8;&#xC5B4; &#xAE30;&#xCD08; &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xC77D;&#xC5B4;&#xBCF4;&#xB294; &#xC790;&#xBC14; &#xAE30;&#xBCF8;&#xC11C;</li>
</ol>
</body></html>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2019/12/04/lifestyle/%ED%8A%B8%EB%9E%9C%EB%93%9C%EC%BD%94%EB%A6%AC%EC%95%842020/" itemprop="url">트렌드 코리아 2020</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2019-12-04T02:38:32.000Z" itemprop="datePublished">Dec 4 2019</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Lifestyle/">Lifestyle</a>
        </span>
        
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#xD2B8;&#xB79C;&#xB4DC; &#xCF54;&#xB9AC;&#xC544; &#xB9E4;&#xB144; &#xD2B8;&#xB80C;&#xB4DC;&#xB97C; &#xB9AC;&#xC11C;&#xCE58;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC608;&#xC0C1; &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xBF51;&#xC544; &#xADF8; &#xC815;&#xBCF4;&#xB97C; &#xCC45;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xCC45;&#xC774;&#xB2E4;.<br>2020&#xB144; &#xB2E4;&#xAC00;&#xC624;&#xB294; &#xD2B8;&#xB79C;&#xB4DC;&#xB85C; &#xC608;&#xC0C1;&#xB418;&#xB294; &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xAC04;&#xB2E8;&#xD788; &#xC815;&#xB9AC;&#xD574;&#xBCF8;&#xB2E4;.</p>
<ol>
<li>&#xBA40;&#xD2F0;&#xD398;&#xB974;&#xC18C;&#xB098;</li>
</ol>
<blockquote>
<p>&#xB098; &#xC790;&#xC2E0;&#xC744; &#xB73B;&#xD558;&#xB294; myself &#xAC00; myselves &#xB85C; &#xBCC0;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xB2E4;&#xC591;&#xD55C; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; &#xD604;&#xB300; &#xC18C;&#xBE44;&#xC790;&#xB294; &#xB9E4;&#xC21C;&#xAC04; &#xBCC0;&#xC2E0;&#xD55C;&#xB2E4;. &#xC774;&#xB97C; &#xD559;&#xC220;&#xC801;&#xC73C;&#xB85C; &#xD398;&#xB974;&#xC18C;&#xB098;&#xB77C; &#xC9C0;&#xCE6D;&#xD55C;&#xB2E4;. &#xB2E4;&#xC6D0;&#xC131; &#xD655;&#xC7A5;&#xB418;&#xACE0; &#xC788;&#xC9C0;&#xB9CC; &#xC5ED;&#xC124;&#xC801;&#xC73C;&#xB85C; &#xC815;&#xCCB4;&#xC131; &#xAE30;&#xBC18;&#xC740; &#xB9E4;&#xC6B0; &#xBD88;&#xC548;&#xC815;&#xD574; &#xC9C0;&#xACE0; &#xC788;&#xB2E4;.</p>
</blockquote>
<ol start="2">
<li>&#xB77C;&#xC2A4;&#xD2B8;&#xD54F; &#xC774;&#xCF54;&#xB178;&#xBBF8;</li>
</ol>
<blockquote>
<p>&#xACE0;&#xAC1D; &#xC811;&#xC810;&#xC758; &#xBC30;&#xC1A1;, &#xC774;&#xB3D9;, &#xAD6C;&#xB9E4; &#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xD65C;&#xB3D9;&#xC5D0;&#xC11C; &#xC774;&#xC804;&#xC758; &#xC131;&#xB2A5;&#xACFC; &#xD488;&#xC9C8;, &#xAC00;&#xACA9; &#xACBD;&#xC7C1;&#xB9CC;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xC18C;&#xBE44;&#xC790;&#xAC00; &#xB9CC;&#xC871;&#xD558;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xC9C8;&#xC774; &#xACBD;&#xC7C1;&#xB825;&#xC744; &#xAC00;&#xC9C0;&#xB294; &#xC2DC;&#xB300;&#xB85C; &#xBCC0;&#xD574;&#xAC00;&#xACE0; &#xC788;&#xB2E4;.</p>
</blockquote>
<ol start="3">
<li>&#xD398;&#xC5B4;&#xD50C;&#xB808;&#xC774;</li>
</ol>
<blockquote>
<p>&#xD604;&#xC7AC; &#xD55C;&#xAD6D; &#xC0AC;&#xD68C;&#xC5D0;&#xC11C;&#xC758; &#xACF5;&#xC815;&#xC131;&#xC758; &#xB300;&#xD55C; &#xC5F4;&#xB9DD;&#xC774; &#xCEE4;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC740; &#xB204;&#xAD6C;&#xB098; &#xB290;&#xB07C;&#xACE0; &#xC788;&#xC744; &#xAC83;&#xC774;&#xB2E4;.</p>
</blockquote>
<ol start="4">
<li>&#xC2A4;&#xD2B8;&#xB9AC;&#xBC0D;&#xB77C;&#xC774;&#xD504;  </li>
</ol>
<blockquote>
<p>&#xC601;&#xC0C1;, &#xC74C;&#xC545;, &#xCC45; &#xBFD0;&#xB9CC;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xB80C;&#xD0C8;&#xC5D0;&#xC11C; &#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC744; &#xC18C;&#xC720;&#xAC00; &#xC544;&#xB2CC; &#xC2A4;&#xD2B8;&#xB9AC;&#xBC0D;&#xC73C;&#xB85C; &#xC990;&#xAE30;&#xB294; &#xC2DC;&#xB300;&#xC774;&#xB2E4;. &#xADF8;&#xB9CC;&#xD07C; &#xC2A4;&#xD2B8;&#xB9AC;&#xBC0D; &#xB77C;&#xC774;&#xD504;&#xB294; &#xB178;&#xB9C8;&#xB4DC; &#xB77C;&#xC774;&#xD504;&#xB97C; &#xC2E4;&#xD604;&#xD558;&#xACE0; &#xC790;&#xD558;&#xB294; &#xD604;&#xB300;&#xC778;&#xC5D0; &#xC694;&#xAD6C;&#xC5D0; &#xB9DE;&#xCDB0; &#xBCC0;&#xD654;&#xD558;&#xACE0; &#xC788;&#xB2E4;.</p>
</blockquote>
<ol start="5">
<li>&#xCD08;&#xAC1C;&#xC778;&#xD654; &#xAE30;&#xC220;</li>
</ol>
<blockquote>
<p>&#xC18C;&#xBE44;&#xC790;&#xB97C; &#xD0C0;&#xAC9F;&#xD305;&#xD560; &#xB54C;&#xC758; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xC774;&#xC81C; 0.1&#xC5D0; &#xAC00;&#xAE4C;&#xC6CC;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;. &#xAC1C;&#xC778;&#xB4E4;&#xC5D0;&#xAC8C; &#xB2E8;&#xC21C;&#xD55C; &#xAC1C;&#xC778;&#xD654;&#xB85C;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xB2C8;&#xC988;&#xB97C; &#xB9CC;&#xC871;&#xC2DC;&#xD0A4;&#xC5D0;&#xB294; &#xBD80;&#xC871;&#xD558;&#xC5EC; &#xCD08;&#xAC1C;&#xC778;&#xD654; &#xAE30;&#xC220;&#xC774; &#xC8FC;&#xC694;&#xD574;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;. AI&#xC640; &#xB370;&#xC774;&#xD130;&#xD130; &#xC608;&#xCE21; &#xB4F1;&#xC758; &#xAE30;&#xC220; &#xBC1C;&#xC804;&#xC73C;&#xB85C; &#xC774;&#xB97C; &#xB354;&#xC6B1; &#xAC00;&#xC18D;&#xD654; &#xB418;&#xACE0; &#xC788;&#xB2E4;.</p>
</blockquote>
<ol start="6">
<li>&#xD32C;&#xC288;&#xBA38;</li>
</ol>
<blockquote>
<p>&#xD32C; + &#xCEE8;&#xC288;&#xBA38; / &#x2018;&#xB0B4;&#xAC00; &#xD0A4;&#xC6E0;&#xB2E4;&#x2019; &#xB77C;&#xB294; &#xB9D0;&#xC774; &#xC810;&#xCC28; &#xB298;&#xACE0; &#xC788;&#xB2E4;. &#xB2E8;&#xC21C;&#xD55C; &#xC18C;&#xBE44;&#xC790;&#xC5D0; &#xBA38;&#xBB3C;&#xC9C0; &#xC54A;&#xACE0; &#xAD00;&#xC2EC;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC18C;&#xBE44;&#xAC00; &#xC544;&#xB2CC; &#xAD00;&#xC5EC;&#xC5D0; &#xCD08;&#xC810;&#xC744; &#xB9DE;&#xCDB0;&#xC9C4; &#xC18C;&#xBE44; &#xD2B8;&#xB79C;&#xB4DC;&#xAC00; &#xAD6C;&#xCD95;&#xB418;&#xACE0; &#xC788;&#xB2E4;.</p>
</blockquote>
<ol start="7">
<li>&#xD2B9;&#xD654;&#xC0DD;&#xC874; </li>
</ol>
<blockquote>
<p>&#xCC28;&#xBCC4;&#xD654;&#xAC00; &#xC544;&#xB2CC; &#xD2B9;&#xBCC4;&#xD654; &#xC815;&#xB9D0; &#xD2B9;&#xD654;&#xD574;&#xC57C; &#xC0DD;&#xC874;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC801;&#xC790; &#xC0DD;&#xC874;&#xC774; &#xC544;&#xB2CC; &#xD2B9;&#xD654; &#xC0DD;&#xC874;. &#xC560;&#xC790;&#xC77C;&#xC801;&#xC778; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC811;&#xADFC;&#xD55C; &#xB9C8;&#xC774;&#xD06C;&#xB85C; &#xB9E4;&#xB2C8;&#xC9D5;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C8; &#xAC83;&#xC774;&#xB2E4;.</p>
</blockquote>
<ol start="8">
<li>&#xC624;&#xD314;&#xC138;&#xB300; </li>
</ol>
<blockquote>
<p>OPAL(Old PeoPle with Active Lives), &#xBCA0;&#xC774;&#xBE44;&#xBD80;&#xBA38;&#xB97C; &#xB300;&#xD45C;&#xD558;&#xB294; 58&#xB144; &#xAC1C;&#xB760;&#xB97C; &#xC758;&#xBBF8;&#xD558;&#xB294; &#xD0A4;&#xC6CC;&#xB4DC;&#xB2E4;. &#xD1F4;&#xC9C1; &#xC774;&#xD6C4;&#xC758; &#xC0AC;&#xD68C;, &#xC18C;&#xBE44; &#xC0DD;&#xD65C; &#xB4F1; &#xC8FC;&#xBAA9; &#xBC1B;&#xACE0; &#xC788;&#xB294; &#xC18C;&#xBE44;&#xC790; &#xB4E4;&#xC774;&#xB2E4;.  </p>
</blockquote>
<ol start="9">
<li>&#xD3B8;&#xB9AC;&#xBBF8;&#xC5C4; </li>
</ol>
<blockquote>
<p>&#xD3B8;&#xB9AC;&#xD568; + &#xD504;&#xB9AC;&#xBBF8;&#xC5C4; &#xBC14;&#xC058;&#xAC8C; &#xC0B4;&#xC544;&#xAC00;&#xB294; &#xD604;&#xB300;&#xC778;&#xB4E4;&#xC5D0;&#xAC8C; &#xC2DC;&#xAC04;&#xC758; &#xBE48;&#xACE4;&#xACFC; &#xADC0;&#xCC2E;&#xC74C;&#xC758; &#xD574;&#xACB0;&#xC740; &#xBB34;&#xC5C7;&#xBCF4;&#xB2E4; &#xC911;&#xC694;&#xD558;&#xB2E4;. &#xC774;&#xB97C; &#xD574;&#xACB0;&#xD574;&#xC8FC;&#xB294; &#xD50C;&#xB7AB;&#xD3FC; &#xB4E4;&#xC744; &#xC8FC;&#xBAA9;&#xD574;&#xC57C; &#xD55C;&#xB2E4;.</p>
</blockquote>
<ol start="10">
<li>&#xC5C5;&#xAE00;&#xC778;&#xAC04;  </li>
</ol>
<blockquote>
<p>&#xC131;&#xACF5;&#xBCF4;&#xB2E4; &#xC131;&#xC7A5;&#xC744; &#xC911;&#xC2DC;&#xD558;&#xACE0; &#xB098;&#xC544;&#xAC00; &#xC790;&#xC2E0;&#xC744; &#xC911;&#xC694;&#xC2DC; &#xD558;&#xB294; &#xBBF8;&#xCF54;&#xB178;&#xBBF8;&#xC758; &#xC18C;&#xBE44;&#xC790;&#xB4E4;&#xC740; &#xBA3C; &#xBBF8;&#xB798;&#xBCF4;&#xB2E4; &#xC9C0;&#xAE08;&#xC758; &#xB098;&#xC740; &#xB0B4;&#xC77C;&#xC758; &#xB098;&#xB97C; &#xBAA9;&#xD45C;&#xB85C; &#xC0B4;&#xC544;&#xAC04;&#xB2E4;. &#xC2E0;&#xB8B0;&#xAC00; &#xAC00;&#xB294; &#xC9C0;&#xC2DD;&#xC744; &#xAC00;&#xACF5;&#xD558;&#xC5EC; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xB4E4;&#xC744; &#xC8FC;&#xBAA9;&#xD560;&#xB9CC; &#xD558;&#xB2E4;.</p>
</blockquote>
<hr>
<p>&#xD2B8;&#xB79C;&#xB4DC; &#xCF54;&#xB9AC;&#xC544;&#xB97C; &#xC77D;&#xACE0; &#xC804;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xAC1C;&#xAC1C;&#xC778;&#xC758; &#xB2E4;&#xC591;&#xC131;&#xC774; &#xB354;&#xC6B1; &#xC911;&#xC694;&#xD558;&#xAC8C; &#xC5EC;&#xAE30;&#xB294; &#xC0AC;&#xD68C;&#xAC00; &#xB418;&#xC5B4; &#xAC00;&#xACE0; &#xC788;&#xC9C0; &#xC54A;&#xC744;&#xAE4C; &#xC2F6;&#xB2E4;.<br>&#xB2E4;&#xC591;&#xD55C; &#xBAA9;&#xC18C;&#xB9AC;&#xAC00; &#xB2E4;&#xC591;&#xD55C; &#xADF8;&#xB8F9;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; &#xAC01;&#xAC01;&#xC758; &#xC131;&#xD5A5;&#xC744; &#xB300;&#xBCC0;&#xD558;&#xB294; &#xC77C;&#xB4E4;&#xC774; &#xC810;&#xCC28; &#xB9CE;&#xC544;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;.  </p>
<p>&#xADF8;&#xB9CC;&#xD07C; &#xC0C9;&#xAE54;&#xC744; &#xC9C0;&#xB2CC; &#xC0AC;&#xB78C;&#xC774; &#xB418;&#xB294; &#xAC83;&#xB3C4; &#xCC38; &#xC911;&#xC694;&#xD558;&#xC9C0; &#xC54A;&#xC744;&#xAE4C; &#xC2F6;&#xB2E4;.  </p>
<p>&#xC0C8;&#xD574; &#xC804;&#xC5D0; &#xAC00;&#xBCCD;&#xAC8C; &#xC77D;&#xC5B4;&#xBCF4;&#xAE30; &#xC88B;&#xC740; &#xCC45;&#xC774;&#xB2E4;.</p>
</body></html>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2019/11/27/lifestyle/1%EB%A7%8C%EC%8B%9C%EA%B0%84%EC%9D%98%EC%9E%AC%EB%B0%9C%EA%B2%AC/" itemprop="url">1만시간의재발견</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2019-11-27T03:59:16.000Z" itemprop="datePublished">Nov 27 2019</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Lifestyle/">Lifestyle</a>
        </span>
        
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x201C; 1&#xB9CC;&#xC2DC;&#xAC04;&#xC758; &#xBC95;&#xCE59; &#x201C; &#xB300;&#xAC8C; &#xC5B4;&#xB5A4; &#xC77C;&#xC5D0; &#xB300;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; 1&#xB9CC;&#xC2DC;&#xAC04;&#xC774; &#xD22C;&#xC790;&#xB41C;&#xB2E4;&#xB77C;&#xB294;<br>&#xC774;&#xB860;&#xC73C;&#xB85C; &#xB110;&#xB9AC; &#xC54C;&#xB824;&#xC838; &#xC788;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC54C;&#xACE0; &#xC788;&#xB2E4;. </p>
<p>&#xB098; &#xB610;&#xD55C; &#xC5B4;&#xB518;&#xAC00;&#xC5D0;&#xC11C; &#xB4E4;&#xC5B4;&#xBCF8; &#xC774;&#xC57C;&#xAE30;.</p>
<p>&#xC0AC;&#xB78C;&#xB4E4;&#xC740; 1&#xB9CC;&#xC2DC;&#xAC04;&#xC758; &#xBC95;&#xCE59;&#xC5D0;&#xC11C; &#xB300;&#xBD80;&#xBD84; &#xC2DC;&#xAC04;&#xC5D0; &#xCD08;&#xC810;&#xC744; &#xB9DE;&#xCD98;&#xB2E4;.<br>&#xC800;&#xC790;&#xB4E4;&#xC740; &#xC2DC;&#xAC04; &#xBCF4;&#xB2E4; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xAC15;&#xC870;&#xD55C;&#xB2E4;.</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xCC45;&#xC758; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xB0B4;&#xC6A9;&#xC740; &#x201C;&#xC758;&#xC2DD;&#xC801;&#xC778; &#xC5F0;&#xC2B5;&#x201D; &#xC774;&#xB77C;&#xB294; &#xB0B4;&#xC6A9;&#xC5D0; &#xB300;&#xD574; &#xC4F0;&#xC5EC;&#xC838;&#xC788;&#xB2E4;.<br>&#xC758;&#xC2DD;&#xC801;&#xC778; &#xC5F0;&#xC2B5;&#xC744; &#xC704;&#xD574;&#xC11C; &#xB2E4;&#xC591;&#xD55C; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xC2DC;&#xD558;&#xACE0; &#xC788;&#xB2E4;. </p>
<p>&#xC81C;&#xC2DC;&#xB41C; &#xBC29;&#xBC95; &#xC911;&#xC5D0; &#xBA87;&#xAC00;&#xC9C0; &#xC778;&#xC0C1;&#xC801;&#xC778; &#xBD80;&#xBD84;&#xC740;</p>
<p>&#xC120;&#xCC9C;&#xC801;&#xC778; &#xC7AC;&#xB2A5;&#xBCF4;&#xB2E4; &#xC81C;&#xB300;&#xB85C;&#xB41C; &#xC5F0;&#xC2B5;&#xACFC; &#xD6C8;&#xB828;&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xC5B4;&#xB5A4; &#xBD84;&#xC57C;&#xC5D0;&#xC11C;&#xB4E0;<br>&#xC7A0;&#xC7AC;&#xB2A5;&#xB825;&#xC744; &#xD0A4;&#xC6B0;&#xACE0; &#xBC1C;&#xC804;&#xD574; &#xB098;&#xC544;&#xAC08; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xC774;&#xB2E4;.</p>
<p>&#xC5B4;&#xB290; &#xC120;&#xAE4C;&#xC9C0; &#xC591;(&#xC2DC;&#xAC04;)&#xC744; &#xD22C;&#xC790; &#xD588;&#xC744; &#xB54C; &#xBC1C;&#xC804;&#xC758; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xACE0;<br>&#xC774;&#xB97C; &#xB118;&#xC5B4;&#xC11C;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xBD84;&#xBA85;&#xD55C; &#xBC29;&#xD5A5;&#xC774; &#xC788;&#xB294; &#xC62C;&#xBC14;&#xB978; &#xD6C8;&#xB828; &#xC774;&#xC5D0; &#xB530;&#xB978; &#xD53C;&#xB4DC;&#xBC31;&#xC774; &#xD544;&#xC694;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xC0DD;&#xAC01;&#xD588;&#xB358; &#xBD80;&#xBD84;&#xACFC; &#xC77C;&#xCE58;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xB9CE;&#xC544; &#xCC45;&#xC744; &#xC77D;&#xB294; &#xB3D9;&#xC548;<br>&#xC2E0;&#xAE30;&#xD558;&#xB2E4;&#xACE0; &#xC5EC;&#xAE30;&#xAC8C; &#xB418;&#xC5C8;&#xB2E4;.</p>
<p>&#xBD84;&#xBA85;&#xD55C; &#xBAA9;&#xD45C;, &#xC62C;&#xBC14;&#xB978; &#xD6C8;&#xB828;, &#xBD80;&#xC871;&#xD55C; &#xBD80;&#xBD84;&#xACFC; &#xBC29;&#xD574;&#xB418;&#xB294; &#xC694;&#xC18C;&#xC774; &#xBC1C;&#xACAC; &#xADF8;&#xB9AC;&#xACE0; &#xC9C0;&#xC18D;&#xD558;&#xB294; &#xD798;</p>
<p>&#xC81C;&#xB300;&#xB41C; &#xC2DC;&#xAC04; &#xD65C;&#xC6A9;&#xB9CC;&#xD07C; &#xC911;&#xC694;&#xD55C; &#xAC74; &#xC5C6;&#xB2E4;&#xACE0; &#xC5EC;&#xAE30;&#xB294; &#xC694;&#xC998;&#xC774;&#xB2E4;.<br>&#xC81C;&#xB300;&#xB85C; &#xB41C; &#xC2DC;&#xAC04; &#xC990;&#xAE30;&#xB294; &#xC0AC;&#xB78C;&#xC774;&#xAE38;</p>
<p>&#xC800;&#xC790;<br>&#xC548;&#xB370;&#xB974;&#xC2A4; &#xC5D0;&#xB9AD;&#xC2A8; : 1&#xB9CC;&#xC2DC;&#xAC04;&#xC758; &#xBC95;&#xCE59; &#xC758; &#xC774;&#xB860;&#xC758; &#xC2EC;&#xB9AC;&#xD559;&#xC790;<br>&#xB85C;&#xBC84;&#xB4DC; &#xD480; : &#xC0AC;&#xC774;&#xC5B8;&#xC2A4;, &#xB124;&#xC774;&#xCC98; &#xB4F1;&#xC758; &#xB9E4;&#xCCB4;&#xC758; &#xAE00;&#xC744; &#xB0A8;&#xAE34; &#xC800;&#xB110;&#xB9AC;&#xC2A4;&#xD2B8;  </p>
</body></html>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2019/11/01/lifestyle/%EB%8F%85%EC%84%9C%EB%AA%A9%EB%A1%9D/" itemprop="url">독서목록</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2019-11-01T02:55:16.000Z" itemprop="datePublished">Nov 1 2019</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Lifestyle/">Lifestyle</a>
        </span>
        
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>2019&#xB144;</p>
<p>&#xD55C;&#xBC88;&#xC5D0; &#xC9D1;&#xD788;&#xB294; &#xB300;&#xB85C; &#xC5EC;&#xB7EC;&#xAD8C;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0;<br>&#xC77D;&#xB294; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC62C;&#xD574;&#xC5D0;&#xB294; &#xB3C5;&#xC11C; &#xD574;&#xBCF4;&#xACE0; &#xC788;&#xB2E4;.  </p>
<p>&#xC77D;&#xB2E4;&#xAC00; &#xD765;&#xBBF8;&#xAC00; &#xB5A8;&#xC5B4;&#xC9C0;&#xB294; &#xCC45;&#xC740; &#xADF8;&#xB0E5; &#xB193;&#xC558;&#xB2E4;.<br>&#xC608;&#xC804; &#xCC98;&#xB7FC; &#xC758;&#xBB34;&#xB85C; &#xC77D;&#xB294; &#xB2E4;&#xB294; &#xAC8C; &#xD53C;&#xACE4;&#xD55C; &#xC77C;&#xC774;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB2E4;&#xBCF4;&#xB2C8; &#xC911;&#xAC04;&#xC5D0; &#xB193;&#xC740; &#xCC45;&#xB4E4;&#xB3C4; &#xB9CE;&#xB2E4;.</p>
<table>
<thead>
<tr>
<th>&#xBC88;&#xD638;</th>
<th>&#xC81C;&#xBAA9;</th>
<th>&#xAD6C;&#xBD84;</th>
<th>&#xBD84;&#xB958;</th>
<th>&#xBE44;&#xACE0;</th>
</tr>
</thead>
<tbody><tr>
<td>1</td>
<td>&#xC791;&#xC740;&#xBD80;&#xC790;&#xB85C; &#xC0AC;&#xB294;&#xBC95;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xC77C;&#xBC18;</td>
<td></td>
</tr>
<tr>
<td>2</td>
<td>&#xADF8;&#xB9BC;&#xC73C;&#xB85C; &#xAC1C;&#xB150;&#xC744; &#xC774;&#xD574;&#xD558;&#xB294; &#xC54C;&#xACE0;&#xB9AC;&#xC998;</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xC54C;&#xACE0;&#xB9AC;&#xC998;</td>
<td></td>
</tr>
<tr>
<td>3</td>
<td><del>&#xCF54;&#xB4DC;&#xCEF4;&#xD50C;&#xB9BF;&#xD2B8;</del></td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xC77C;&#xBC18;</td>
<td></td>
</tr>
<tr>
<td>4</td>
<td>&#xB098;&#xB294; &#xC624;&#xB298;&#xBD80;&#xD130; &#xACBD;&#xC81C;&#xAE30;&#xC0AC;&#xB97C; &#xC77D;&#xAE30;&#xB85C;&#xD588;&#xB2E4;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xC0C1;&#xC2DD;</td>
<td></td>
</tr>
<tr>
<td>5</td>
<td>&#xBD80;&#xC758; &#xCD94;&#xC6D4;&#xCC28;&#xC120;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xBC29;&#xBC95;&#xB860;</td>
<td></td>
</tr>
<tr>
<td>6</td>
<td>&#xC6B4;&#xC774; &#xD480;&#xB9AC;&#xB294; &#xB9D0;&#xBC84;&#xB987;</td>
<td>&#xC790;&#xAE30;&#xAC1C;&#xBC1C;</td>
<td>&#xBC29;&#xBC95;</td>
<td></td>
</tr>
<tr>
<td>7</td>
<td>&#xD6C4;&#xCC9C;&#xC801;&#xBD80;&#xC790;&#xB4E4;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xD22C;&#xC790;</td>
<td></td>
</tr>
<tr>
<td>8</td>
<td>&#xADF8;&#xB9BC;&#xC73C;&#xB85C; &#xC815;&#xB9AC;&#xD55C; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xACFC; &#xC790;&#xB8CC;&#xAD6C;&#xC870;</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xC54C;&#xACE0;&#xB9AC;&#xC998;</td>
<td></td>
</tr>
<tr>
<td>9</td>
<td>&#xD589;&#xBCF5;&#xD55C;&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xC77C;&#xBC18;</td>
<td></td>
</tr>
<tr>
<td>10</td>
<td>Vue.js &#xC785;&#xBB38;</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xC5B8;&#xC5B4;</td>
<td></td>
</tr>
<tr>
<td>11</td>
<td>HTTP &#xC644;&#xBCBD;&#xAC00;&#xC774;&#xB4DC;</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xB124;&#xD2B8;&#xC6CC;&#xD06C;</td>
<td></td>
</tr>
<tr>
<td>12</td>
<td>Effective Java</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xBC29;&#xBC95;&#xB860;</td>
<td></td>
</tr>
<tr>
<td>13</td>
<td>&#xCC98;&#xC74C;&#xBC30;&#xC6B0;&#xB294; &#xC2A4;&#xD504;&#xB9C1;&#xBD80;&#xD2B8;</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;</td>
<td></td>
</tr>
<tr>
<td>14</td>
<td><del>&#xB3C4;&#xB09C;&#xB2F9;&#xD55C;&#xD328;&#xC2A4;&#xC6CC;&#xB4DC;</del></td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xBCF4;&#xC548;</td>
<td></td>
</tr>
<tr>
<td>15</td>
<td>&#xBD80;&#xC790;&#xC544;&#xBE60;&#xAC00;&#xB09C;&#xD55C;&#xC544;&#xBE60;1</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xC77C;&#xBC18;</td>
<td></td>
</tr>
<tr>
<td>16</td>
<td>&#xBD80;&#xC790;&#xC544;&#xBE60;&#xAC00;&#xB09C;&#xD55C;&#xC544;&#xBE60;2</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xC77C;&#xBC18;</td>
<td></td>
</tr>
<tr>
<td>17</td>
<td>&#xB514;&#xC790;&#xC778; &#xC53D;&#xD0B9; &#xBC14;&#xC774;&#xBE14;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xB9C8;&#xCF00;&#xD305;</td>
<td></td>
</tr>
<tr>
<td>18</td>
<td><del>&#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD601;&#xBA85;</del></td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xC0C1;&#xC2DD;</td>
<td></td>
</tr>
<tr>
<td>19</td>
<td>&#xB098;&#xC758; &#xC6D4;&#xAE09; &#xB3C5;&#xB9BD;&#xD504;&#xB85C;&#xC81D;&#xD2B8;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xD22C;&#xC790;</td>
<td></td>
</tr>
<tr>
<td>20</td>
<td>&#xB3C8;&#xC774;&#xB418;&#xB294; &#xC544;&#xD30C;&#xD2B8; &#xB3C8;&#xC774; &#xC548;&#xB418;&#xB294; &#xC544;&#xD30C;&#xD2B8;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xD22C;&#xC790;</td>
<td></td>
</tr>
<tr>
<td>21</td>
<td><del>&#xD0D1;&#xCF54;&#xB354;&#xC54C;&#xACE0;&#xB9AC;&#xC998;</del></td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xC54C;&#xACE0;&#xB9AC;&#xC998;</td>
<td></td>
</tr>
<tr>
<td>22</td>
<td>&#xB3C8; &#xB728;&#xAC81;&#xAC8C; &#xC0AC;&#xB791;&#xD558;&#xACE0; &#xCC28;&#xAC11;&#xAC8C; &#xB2E4;&#xB8E8;&#xC5B4;&#xB77C;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xD22C;&#xC790;</td>
<td></td>
</tr>
<tr>
<td>23</td>
<td>&#xD22C;&#xC790;&#xB294; &#xC2EC;&#xB9AC;&#xAC8C;&#xC784;&#xC774;&#xB2E4;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xD22C;&#xC790;</td>
<td></td>
</tr>
<tr>
<td>24</td>
<td>&#xC778;&#xC2A4;&#xD30C;&#xC774;&#xC5B4;&#xB4DC;</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xC81C;&#xD488;&#xAD00;&#xB9AC;</td>
<td></td>
</tr>
<tr>
<td>25</td>
<td>1&#xB9CC;&#xC2DC;&#xAC04;&#xC758; &#xC7AC;&#xBC1C;&#xACAC;</td>
<td>&#xC790;&#xAE30;&#xAC1C;&#xBC1C;</td>
<td>&#xBC29;&#xBC95;&#xB860;</td>
<td></td>
</tr>
<tr>
<td>26</td>
<td>&#xD1A0;&#xBE44;&#xC758;&#xC2A4;&#xD504;&#xB9C1;</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;</td>
<td>ing</td>
</tr>
<tr>
<td>27</td>
<td>&#xD06C;&#xB9AC;&#xC5D0;&#xC774;&#xD2F0;&#xBE0C;&#xB294; &#xB2E8;&#xB828;&#xB41C;&#xB2E4;</td>
<td>&#xC790;&#xAE30;&#xAC1C;&#xBC1C;</td>
<td>&#xAD11;&#xACE0;/&#xB9C8;&#xCF00;</td>
<td></td>
</tr>
<tr>
<td>28</td>
<td>&#xD2B8;&#xB80C;&#xB4DC;&#xCF54;&#xB9AC;&#xC544; 2020</td>
<td>&#xC77C;&#xBC18;</td>
<td>&#xD2B8;&#xB79C;&#xB4DC;</td>
<td>ing</td>
</tr>
<tr>
<td>29</td>
<td>1&#xC77C; 1&#xC9E0; &#xB3C8;&#xC2B5;&#xAD00;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xBC29;&#xBC95;</td>
<td></td>
</tr>
<tr>
<td>30</td>
<td>&#xB098;&#xB294; &#xC544;&#xB9C8;&#xC874;&#xC5D0;&#xC11C; &#xBBF8;&#xB798;&#xB97C; &#xB2E4;&#xB154;&#xB2E4;</td>
<td>&#xC77C;&#xBC18;</td>
<td>IT &#xAD00;&#xB828;</td>
<td></td>
</tr>
<tr>
<td>31</td>
<td>&#xCC3D;&#xC5C5; &#xC624;&#xB298; &#xC548;&#xD558;&#xBA74; &#xB0B4;&#xC77C;&#xB3C4; &#xBABB;&#xD55C;&#xB2E4;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xCC3D;&#xC5C5;</td>
<td></td>
</tr>
<tr>
<td>32</td>
<td>&#xC220; &#xC7A1;&#xD559;&#xC0AC;&#xC804;</td>
<td>&#xC77C;&#xBC18;</td>
<td>&#xC0C1;&#xC2DD;</td>
<td></td>
</tr>
<tr>
<td>33</td>
<td>&#xC2A4;&#xD504;&#xB9C1;&#xBD80;&#xD2B8; 2</td>
<td>&#xAC1C;&#xBC1C;</td>
<td>&#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;</td>
<td></td>
</tr>
<tr>
<td>34</td>
<td>&#xBD88;&#xB7C9;&#xD5EC;&#xC2A4;</td>
<td>&#xC77C;&#xBC18;</td>
<td>&#xC6B4;&#xB3D9;</td>
<td></td>
</tr>
<tr>
<td>35</td>
<td>90&#xB144;&#xC0DD;&#xC774; &#xC628;&#xB2E4;</td>
<td>&#xACBD;&#xC81C;</td>
<td>&#xACBD;&#xC601;</td>
<td></td>
</tr>
</tbody></table>
<p>&#xCC45;&#xC744; &#xC77D;&#xAE30;&#xB9CC; &#xD55C;&#xB2E4;&#xACE0; &#xC9C0;&#xC2DD;&#xC774; &#xAE4A;&#xC5B4;&#xC9C0;&#xC9C4; &#xC54A;&#xB294;&#xB2E4;.<br>&#xADF8;&#xB0E5; &#xAE00;&#xC744; &#xC77D;&#xAE30;&#xB9CC; &#xD560;&#xBFD0;&#x2026;</p>
<p>&#xC815;&#xB9AC;&#xD558;&#xACE0; &#xC9C0;&#xC2DD;&#xC744; &#xC18C;&#xD654;&#xD558;&#xC790;.</p>
</body></html>
    
    </div>
    
    
</article>




    
    
    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 Ethan&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("en-AU");
</script>


    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="Type something..." />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: 'Posts',
                PAGES: 'Pages',
                CATEGORIES: 'Categories',
                TAGS: 'Tags',
                UNTITLED: '(Untitled)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>